### Deployment Results :white_check_mark:

 **GrantBirki** successfully **branch** deployed branch `GrantBirki-patch-1` to **production**





<details><summary>Show Results</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.cache must be replaced
-/+ resource "cloudflare_record" "cache" {
      ~ created_on      = "2022-06-11T16:27:09.021018Z" -> (known after apply)
      ~ hostname        = "cache.tarkov.dev" -> (known after apply)
      ~ id              = "03fe31c72264d5c29ed63ab520988055" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
      ~ modified_on     = "2024-03-10T23:34:38.311464Z" -> (known after apply)
        name            = "cache"
      ~ proxiable       = true -> (known after apply)
      ~ type            = "A" -> "CNAME" # forces replacement
      ~ value           = "20.124.115.39" -> "tarkov-cache.azurewebsites.net"
        # (4 unchanged attributes hidden)
    }

  # cloudflare_record.cache_azure_function_verification will be created
  + resource "cloudflare_record" "cache_azure_function_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "asuid.cache"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "966A35FCB4A0FE1176E2320038F9EA960F6E2FE36A69ABDFC79A272FE4E2228F"
      + zone_id         = "a17204c79af55fcf05e4975f66e2490e"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
cloudflare_record.cache: Destroying... [id=03fe31c72264d5c29ed63ab520988055]
cloudflare_record.cache_azure_function_verification: Creating...
cloudflare_record.cache: Destruction complete after 0s
cloudflare_record.cache: Creating...
cloudflare_record.cache_azure_function_verification: Creation complete after 1s [id=2f52f776bbb5d137730086c7579663a4]
cloudflare_record.cache: Creation complete after 1s [id=180e6c5a5414843333d449244962bf01]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```

</details>
